# Задача №17.Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

lis_1 = [1, 1, 2, 0, -1, 3, 4, 4]

print(lis_1)
print (len(lis_1))
set  = lis_1[]
print(set)